Repository: akornatskyy/relib-demo
Catalog: Components-IoC/Source/Public/WebMvc/Views/Error/Resources/HttpError.*.resx
Languages: ru

# DescriptionAntiForgery
source: The server was unable to process your request due to possible session termination.
ru: Сервер не смог обработать Ваш запрос в связи с возможным прекращением сессии.

# DescriptionHttp400
source: The 400 Bad Request error is an HTTP status code that means that the request you sent to the website server (i.e. a request to load a web page) was somehow malformed therefore the server was unable to understand or process the request.
ru: 400 Неверный запрос - это код статуса HTTP ошибки, который означает, что вы послали запрос на сайт сервера (например, запрос на загрузку веб-страниц) как-то неправильно, следовательно, сервер не смог понять и обработать запрос.

# DescriptionHttp403
source: You do not have permission to view this directory or page using the credentials that you supplied.
ru: У вас нет разрешения на просмотр этого каталога или страницы с использованием учетных данных, которые Вы предоставили.

# DescriptionHttp404
source: Unfortunately the page you are looking for may have been removed, had its name changed, under construction or is temporarily unavailable. Try checking the web address for typos, please. We apologize for the inconvenience.
ru: К сожалению, страница, которую вы ищете, возможно, была удалена, переименована, в стадии разработки или временно недоступна. Попробуйте проверить веб-адрес на опечатки, пожалуйста. Мы приносим свои извинения за причиненные неудобства.

# DescriptionHttp500
source: The web server encountered an unexpected condition that prevented it from fulfilling the request by the client for access to the requested URL.
ru: Веб-сервер столкнулся с неожиданной ситуацией, что помешало ему выполнить запрос клиента для доступа по URL.

# DescriptionIpPolicy
source: One of your ip addresses does not match site policy. That prevents you from accessing our service.
ru: Один из ваших IP адресов не удовлетворяет политику сайта. Это предотвращает доступ к нашему сервису.

# DescriptionRequestValidation
source: The server was unable to process your request due to detected forbidden value. Please try to avoid using the "&lt;" character and/or a character combination of "&amp;#" within the URL and/or form values. Please check your request and try again.
ru: Сервер не смог обработать Ваш запрос в связи с обнаруженым запрещенным значением. Пожалуйста, постарайтесь избегать использования символа "<" и / или сочетания "& #" в URL и / или в форме. Пожалуйста, проверьте ваш запрос и повторите попытку.

# HeaderAntiForgery
source: <strong>Oops! Anti forgery error.</strong> Sorry, we can't process your request.
ru: <strong>Ой! Ошибка поддельного запроса.</strong> К сожалению, мы не можем обработать Ваш запрос.

# HeaderHttp400
source: <strong>Oops! Code 400.</strong> Sorry, we can't process your request.
ru: <strong>Ой! Код ошибки 400.</strong> К сожалению, мы не можем обработать Ваш запрос.

# HeaderHttp403
source: <strong>Oops! Code 403.</strong> Access is denied.
ru: <strong>Ой! Код ошибки 403.</strong> Доступ запрещен.

# HeaderHttp404
source: <strong>Oops! Code 404.</strong> Sorry, we can't find that page.
ru: <strong>Ой! Код ошибки 404.</strong> К сожалению, запрашиваемая страница не найдена.

# HeaderHttp500
source: <strong>Oops! Code 500.</strong> Sorry, we can't process your request.
ru: <strong>Ой! Код ошибки 500.</strong> К сожалению, мы не можем обработать Ваш запрос.

# HeaderIpPolicy
source: <strong>Oops! Code 403.</strong> IP Policy.
ru: <strong>Ой! Код ошибки 403.</strong> Политика IP безопасности.

# HeaderRequestValidation
source: <strong>Oops! Request validation error.</strong> Sorry, we can't process your request.
ru: <strong>Ой! Ошибка проверки запроса.</strong> К сожалению, мы не можем обработать Ваш запрос.

# TitleAntiForgery
source: Request antiforgery error
ru: Ошибка поддельного запроса

# TitleHttp400
source: Bad request
ru: Неверный запрос

# TitleHttp403
source: Access denied
ru: Доступ запрещен

# TitleHttp404
source: We are sorry, the page you requested cannot be found.
ru: К сожалению, запрашиваемая страница не найдена.

# TitleHttp500
source: We are sorry, we can't process your request.
ru: К сожалению, мы не можем обработать Ваш запрос.

# TitleRequestValidation
source: Request validation error
ru: Ошибка проверки запроса
